# ====================
# Shell & Core
# ====================
brew "fish"
brew "fisher"
brew "just"
brew "tmux"

# ====================
# Git & Version Control
# ====================
brew "git"
brew "gh"
brew "git-delta"
brew "lazygit"

# ====================
# CLI Utilities
# ====================
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"

# ====================
# Data Processors
# ====================
brew "jq"
brew "htmlq"

# ====================
# Editors
# ====================
brew "neovim"

# ====================
# PHP Tooling (nvim)
# ====================
# phpactor: install via brew or composer (composer is often more up-to-date)
# brew "phpactor"
# OR: composer global require phpactor/phpactor
brew "node"          # required for vscode-php-debug (xdebug adapter) + twiggy LSP
# php-cs-fixer: install via brew or per-project via composer (composer require --dev friendsofphp/php-cs-fixer)
# brew "php-cs-fixer"  # PHP formatter (conform.nvim)

# ====================
# Fonts
# ====================
cask "font-jetbrains-mono-nerd-font"
