# ====================
# Shell & Core
# ====================
brew "fish"
brew "fisher"
brew "just"
brew "mise"
brew "zellij"

# ====================
# Git & Version Control
# ====================
brew "git"
brew "gh"
brew "git-delta"
brew "lazygit"

# ====================
# CLI Utilities
# ====================
brew "topgrade"
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "yazi"
brew "atuin"
brew "direnv"
brew "try"
brew "btop"
brew "fastfetch"
brew "gum"
brew "glow"
brew "tealdeer"
brew "jiratui"
brew "jira-cli"
if OS.mac?
  brew "pngpaste"
end

# ====================
# Data Processors
# ====================
brew "jq"
brew "htmlq"
brew "yq"

# ====================
# Editors
# ====================
brew "neovim"
brew "tree-sitter-cli"

# ====================
# Containers
# ====================
brew "lazydocker"
brew "k9s"

# ====================
# Databases
# ====================
brew "lazysql"
brew "pgcli"
brew "libpq"
brew "sqlite"
brew "redis"
